nicslabdev/MOTAM-nRF52_Beacons/intelligent_traffic_light/main.c
/***************************************************************************************/
/*
 * intelligent_traffic_light
 * Created by Manuel Montenegro, Jul 09, 2019.
 * Developed for MOTAM project.
 *
 *  This is a secure connected traffic light. The management connection with LTE-M modem 
 *  (Particle Boron LTE) is over serial pins. The traffic light state is broadcasted over
 *  long range BLE. BLE authentication has been developed using CC310 crypto functions.
 *
 *  This code has been developed for Nordic Semiconductor nRF52840 PDK & nRF52840 dongle.
*/
/***************************************************************************************/

#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <stddef.h>
#include <stdio.h>

#include "sdk_common.h"

#include "nrf.h"
#include "nrf_assert.h"
#include "nrf_pwr_mgmt.h"
#include "nrf_gpio.h"
#include "nrf_delay.h"
#include "nrf_drv_power.h"
#include "nrf_drv_clock.h"
#include "nrf_drv_gpiote.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "ble_radio_notification.h"

#include "app_error.h"
#include "app_util.h"
#include "app_timer.h"

#include "mem_manager.h"

#include "nrf_crypto.h"
#include "nrf_crypto_error.h"
#include "nrf_crypto_ecc.h"
#include "nrf_crypto_ecdsa.h"

#include "nrf_serial.h"
#include "boards.h"


// ======== Global configuration and functions ========

#define RED_STATE                               0x01                                        // Identifier of Red traffic light state
#define YELLOW_STATE                            0x02                                        // Identifier of Yellow traffic light state
#define GREEN_STATE                             0x03                                        // Identifier of Green traffic light state
#define EMERGENCY_RED_STATE                     0x04                                        // Identifier of red state due to a emergency vehicle is near
#define EMERGENCY_GREEN_STATE                   0x05                                        // Identifier of green state due to a emergency vehicle is near
#define RED_STATE_DURATION                      5                                          // Duration of red traffic light state in seconds (MINIMUM VALUE: 5 SECONDS)
#define YELLOW_STATE_DURATION                   2                                           // Duration of yellow traffic light state in seconds
#define GREEN_STATE_DURATION                    5                                           // Duration of green traffic light state in seconds
#define BLINKY_STATE_DURATION                   1                                           // Duration of blinky state of pedestrian green light
#define BEACON_UPDATE_INTERVAL                  500                                         // Time interval in what beacon frame is updated (and crypto signature recalculated)
static uint8_t                                  lastState;                                  // Last traffic light state
static uint8_t                                  currentState;                               // Current traffic light state
static uint32_t                                 lastStateTicks;                             // Timers ticks of the last state change
static uint32_t                                 unixTimestamp;                              // UNIX Timestamp received from Particle Boron LTE

static uint32_t timer_ticks_to_ms (uint32_t ticks);
static uint8_t current_state_duration ();

// BLE events handler declaration
static void ble_evt_handler (ble_evt_t const * p_ble_evt, void * p_context);
static void frame_init (void);

// Crypto signature function declaration
static void sign_frame ();


// ======== Serial configuration ========

static char serial_rx [256];

#define RX_PIN_SERIAL NRF_GPIO_PIN_MAP(0,24)
#define TX_PIN_SERIAL NRF_GPIO_PIN_MAP(1,00)

// Serial port sleep handler
static void sleep_handler(void)
{
    __WFE();
    __SEV();
    __WFE();
}

static void event_handler (struct nrf_serial_s const *p_serial, nrf_serial_event_t event);

NRF_SERIAL_DRV_UART_CONFIG_DEF(m_uarte0_drv_config,
                      RX_PIN_SERIAL, TX_PIN_SERIAL,
                      NULL, NULL,
                      NRF_UART_HWFC_DISABLED, NRF_UART_PARITY_EXCLUDED,
                      NRF_UART_BAUDRATE_115200,
                      UART_DEFAULT_CONFIG_IRQ_PRIORITY);


NRF_SERIAL_DRV_UART_CONFIG_DEF(m_uarte1_drv_config,
                      RX_PIN_NUMBER, TX_PIN_NUMBER,
                      RTS_PIN_NUMBER, CTS_PIN_NUMBER,
                      NRF_UART_HWFC_DISABLED, NRF_UART_PARITY_EXCLUDED,
                      NRF_UART_BAUDRATE_115200,
                      UART_DEFAULT_CONFIG_IRQ_PRIORITY);

#define SERIAL_FIFO_TX_SIZE 32
#define SERIAL_FIFO_RX_SIZE 32

NRF_SERIAL_QUEUES_DEF(serial0_queues, SERIAL_FIFO_TX_SIZE, SERIAL_FIFO_RX_SIZE);
NRF_SERIAL_QUEUES_DEF(serial1_queues, SERIAL_FIFO_TX_SIZE, SERIAL_FIFO_RX_SIZE);

#define SERIAL_BUFF_TX_SIZE 1
#define SERIAL_BUFF_RX_SIZE 1

NRF_SERIAL_BUFFERS_DEF(serial0_buffs, SERIAL_BUFF_TX_SIZE, SERIAL_BUFF_RX_SIZE);
NRF_SERIAL_BUFFERS_DEF(serial1_buffs, SERIAL_BUFF_TX_SIZE, SERIAL_BUFF_RX_SIZE);

NRF_SERIAL_CONFIG_DEF(serial0_config, NRF_SERIAL_MODE_DMA,
                      &serial0_queues, &serial0_buffs, event_handler, sleep_handler);
NRF_SERIAL_CONFIG_DEF(serial1_config, NRF_SERIAL_MODE_DMA,
                      &serial1_queues, &serial1_buffs, event_handler, sleep_handler);

NRF_SERIAL_UART_DEF(serial0_uarte, 0);
NRF_SERIAL_UART_DEF(serial1_uarte, 1);

static void event_handler (struct nrf_serial_s const *p_serial, nrf_serial_event_t event) 
{
    if (event == NRF_SERIAL_EVENT_RX_DATA) {
        char c;
        static int cont = 0;

        APP_ERROR_CHECK(nrf_serial_read(p_serial, &c, sizeof(c), NULL, 500));

