nicslabdev/MOTAM-nRF52_Beacons/intelligent_traffic_light/main.c
        if (c!='\n')
        {
            serial_rx[cont] = c;
            cont++;
        }
        else
        {
//            serial_rx[cont] = '\0';
//                            nrf_serial_write(&serial1_uarte,
//                           serial_rx,
//                           cont,
//                           NULL,
//                           NRF_SERIAL_MAX_TIMEOUT);
//
//                (void)nrf_serial_flush(&serial1_uarte, 0);
            cont = 0;
        } 
           
                
    }
}

static void serial_init(void)
{
    ret_code_t ret = nrf_serial_init(&serial0_uarte, &m_uarte0_drv_config, &serial0_config);
    APP_ERROR_CHECK(ret);
    ret = nrf_serial_init(&serial1_uarte, &m_uarte1_drv_config, &serial1_config);
    APP_ERROR_CHECK(ret);
}


// ======== BLE configuration ========

// MOTAM Beacon default advertising frame
#define BEACON_LENGTH_FIELD                     86                                          // Length of advertising data (see BLE documentation)
#define ADV_DATA_TYPE                           0xFF                                        // Advertising data type (0xFF -> Manufacturer specific data)
#define MOTAM_ID                                0xBE, 0x5E                                  // MOTAM identifier (5Ecure BEacon)
#define DEFAULT_TIMESTAMP                       0x00, 0x00, 0x00, 0x00                      // Default UNIX timestamp
#define BEACON_TYPE                             0x05                                        // Type of MOTAM beacon (0x05 -> Intelligent Traffic Light)
#define LATITUDE                                0x42, 0x12, 0xDD, 0x41                      // GPS latitude of the beacon (float in little endian)
#define LONGITUDE                               0xC0, 0x8F, 0xEE, 0x72                      // GPS longitude of the beacon (float in little endian)
#define DEVICE_ID                               LATITUDE, LONGITUDE                         // Device ID on traffic light corresponds the gps coordinates
#define DIRECTION_FROM                          0x01, 0X0E                                  // From direction that applies (35)
#define DIRECTION_TO                            0x00, 0x5A                                  // To direction that applies (280)
#define DEFAULT_STATE                           0xFF                                        // Current state (0x00 red, 0x01 yellow, 0x02 green, 0xFF undeterminated)
#define DEFAULT_TIMELEFT                        0X00                                        // Time left for next state (0x00 -> no timeout)
                                                                                            // Signature of default frame (SECP256K1)
#define DEFAULT_SIGN                            0x51, 0x51, 0x51, 0x51, 0x51, 0x51, 0x51, 0x51, \
                                                0x51, 0x51, 0x51, 0x51, 0x51, 0x51, 0x51, 0x51, \
                                                0x51, 0x51, 0x51, 0x51, 0x51, 0x51, 0x51, 0x51, \
                                                0x51, 0x51, 0x51, 0x51, 0x51, 0x51, 0x51, 0x51, \
                                                0x51, 0x51, 0x51, 0x51, 0x51, 0x51, 0x51, 0x51, \
                                                0x51, 0x51, 0x51, 0x51, 0x51, 0x51, 0x51, 0x51, \
                                                0x51, 0x51, 0x51, 0x51, 0x51, 0x51, 0x51, 0x51, \
                                                0x51, 0x51, 0x51, 0x51, 0x51, 0x51, 0x51, 0x51

// BLE configuration parameters
#define APP_BLE_CONN_CFG_TAG                    1                                           // Tag that identifies the BLE configuration of the SoftDevice
#define APP_BLE_OBSERVER_PRIO                   3                                           // BLE observer priority of the application. There is no need to modify this value
#define ADV_INTERVAL                            MSEC_TO_UNITS(100, UNIT_0_625_MS)           // The advertising interval for non-connectable advertisement

static ble_gap_adv_params_t                     m_adv_params;                               // Parameters to be passed to the stack when starting advertising
static ble_gap_adv_data_t                       m_adv_data;                                 // Struct that contains pointers to the BLE encoded advertising data
static uint8_t                                  m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;  // Advertising handle used to identify an advertising set
static uint8_t                                  m_enc_advdata_1 [BLE_GAP_ADV_SET_DATA_SIZE_EXTENDED_MAX_SUPPORTED]; // Buffer for storing encoded advertising data
static uint8_t                                  m_enc_advdata_2 [BLE_GAP_ADV_SET_DATA_SIZE_EXTENDED_MAX_SUPPORTED]; // Buffer for storing encoded advertising data

// Frame that will be broadcasted by BLE advertising
#define BEACON_FRAME_LENGTH                     BEACON_LENGTH_FIELD + 1                     // Length of MOTAM advertising frame
static uint8_t frame [BEACON_FRAME_LENGTH] =                                                // Intelligent traffic light broadcast frame
        {
            BEACON_LENGTH_FIELD,
            ADV_DATA_TYPE,
            MOTAM_ID,
            DEFAULT_TIMESTAMP,
            BEACON_TYPE,
            DEVICE_ID,
            DIRECTION_FROM,
            DIRECTION_TO,
            DEFAULT_STATE,
            DEFAULT_TIMELEFT,
            DEFAULT_SIGN
        };

// Function for initializing the BLE stack
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}

