nicslabdev/MOTAM-nRF52_Beacons/intelligent_traffic_light/main.c
// Handle the pedestrian timer: start blinky pedestrian green light
static void timer_handler_pedestrian (void *p_context)
{
    ret_code_t err_code;

    static int blink_cont = (int) BLINKY_STATE_DURATION / 0.25;                             // Number of cycles of turning on-turning off

    if (blink_cont > 0)
    {
        if (!(blink_cont%2))
        {
            nrf_gpio_pin_clear(LED_GREEN_PEDESTRIAN);
            blink_cont--;
            err_code = app_timer_start ( timer_pedestrian, APP_TIMER_TICKS(250), NULL);
            APP_ERROR_CHECK(err_code);
        }
        else if (blink_cont%2)
        {
            nrf_gpio_pin_set(LED_GREEN_PEDESTRIAN);
            blink_cont--;
            err_code = app_timer_start ( timer_pedestrian, APP_TIMER_TICKS(250), NULL);
            APP_ERROR_CHECK(err_code);
        }
    }
    else
    {
        blink_cont = (int) BLINKY_STATE_DURATION / 0.25;
    }
}


static void timers_start (void);

// Handle the frame_update time: the frame is updated periodically and the crypto signature calculated
static void timer_handler_frame_update (void *p_context)
{

    static uint8_t staticState = 0;

    static uint8_t old_timeout = DEFAULT_TIMELEFT;
    static uint8_t old_currentState = DEFAULT_STATE;
    uint8_t timeout = current_state_duration() - (timer_ticks_to_ms (app_timer_cnt_diff_compute (app_timer_cnt_get(),lastStateTicks))/1000);


//        char timestampChar [11];
//        memcpy (timestampChar,serial_rx,sizeof(timestampChar));
//        timestampChar[10] = '\0';
     
        nrf_serial_write(&serial1_uarte,
                               serial_rx,
                               30,
                               NULL,
                               NRF_SERIAL_MAX_TIMEOUT);
        (void)nrf_serial_flush(&serial1_uarte, 0);


    if (serial_rx[11] == 'd')
    {
        char redTimeChar [3];
        char yellowTimeChar [3];
        char greenTimeChar [3];

        memcpy(redTimeChar, &serial_rx[19], 3);
        memcpy(yellowTimeChar, &serial_rx[23], 3);
        memcpy(greenTimeChar, &serial_rx[27], 3);

        int newRedTime = atoi(redTimeChar);
        int newYellowTime = atoi(yellowTimeChar);
        int newGreenTime = atoi(greenTimeChar);

        DURATION_RED = APP_TIMER_TICKS(newRedTime*1000);
        DURATION_YELLOW = APP_TIMER_TICKS(newYellowTime*1000);
        DURATION_GREEN = APP_TIMER_TICKS(newGreenTime*1000);

//        DURATION_RED =APP_TIMER_TICKS(RED_STATE_DURATION*1000);
//        DURATION_YELLOW =APP_TIMER_TICKS(YELLOW_STATE_DURATION*1000);
//        DURATION_GREEN =APP_TIMER_TICKS(GREEN_STATE_DURATION*1000);

        if (staticState == 1)
        {
            timers_start();
            staticState = 0;
        }

    }
    else if (serial_rx[11] == 's')
    {
        ret_code_t err_code;
        err_code = app_timer_stop(timer);
        APP_ERROR_CHECK(err_code);
        err_code = app_timer_stop (timer_pedestrian);
        APP_ERROR_CHECK(err_code);
        
        pins_clear ();

        if (serial_rx[18] == '1')
        {
            nrf_gpio_pin_set(LED_GREEN);
            nrf_gpio_pin_set(LED_RED_PEDESTRIAN);
        }
        else if (serial_rx[18] == '2')
        {
            nrf_gpio_pin_set(LED_YELLOW);
            nrf_gpio_pin_set(LED_RED_PEDESTRIAN);
        }
        else if (serial_rx[18] == '3')
        {
            nrf_gpio_pin_set(LED_RED);
            nrf_gpio_pin_set(LED_RED_PEDESTRIAN);
        }
        staticState = 1;
    }



    if (currentState != old_currentState || timeout != old_timeout) 
    {
        frame[21] = currentState;
        frame[22] = timeout;
        memcpy(&frame[4],&unixTimestamp,sizeof(unixTimestamp));
        sign_frame();
        old_timeout = timeout;
        old_currentState = currentState;


        // Send to Particle Boron current timeout and state
        char timeoutChar [3];
        char currentStateChar [1];
        itoa(timeout,timeoutChar, 10);
        itoa(currentState, currentStateChar, 10);

        nrf_serial_write(&serial0_uarte,
                           currentStateChar,
                           strlen(currentStateChar),
                           NULL,
                           NRF_SERIAL_MAX_TIMEOUT);

        nrf_serial_write(&serial0_uarte,
                           timeoutChar,
                           strlen(timeoutChar),
                           NULL,
                           NRF_SERIAL_MAX_TIMEOUT);

        static char tx_message[] = "\r\n";

        nrf_serial_write(&serial0_uarte,
                           tx_message,
                           strlen(tx_message),
                           NULL,
                           NRF_SERIAL_MAX_TIMEOUT);

        (void)nrf_serial_flush(&serial0_uarte, 0);
    }
}

// Timer initialization
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create	( &timer, APP_TIMER_MODE_SINGLE_SHOT, timer_handler );
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create ( &timer_pedestrian, APP_TIMER_MODE_SINGLE_SHOT, timer_handler_pedestrian );
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create ( &timer_frame_update, APP_TIMER_MODE_REPEATED, timer_handler_frame_update );
    APP_ERROR_CHECK(err_code);
}

// Start the execution of concatenated timers
static void timers_start (void)
{
    ret_code_t err_code;
    timer_handler (NULL);
    err_code = app_timer_start ( timer_frame_update, APP_TIMER_TICKS(BEACON_UPDATE_INTERVAL), NULL);
}

// Convert timer ticks to miliseconds
static uint32_t timer_ticks_to_ms (uint32_t ticks)
{
    return (ticks * 1000 * ((APP_TIMER_CONFIG_RTC_FREQUENCY) +1)) / APP_TIMER_CLOCK_FREQ;
}


// ======== Auxiliary functions ========

// Returns the duration of current traffic light state in seconds
static uint8_t current_state_duration ( )
{
    if (currentState == RED_STATE)
        return RED_STATE_DURATION;
    else if (currentState == YELLOW_STATE)
        return YELLOW_STATE_DURATION;
    else if (currentState == GREEN_STATE)
        return GREEN_STATE_DURATION;
    else
        return 0;
}


// ======== Board initialization ========

// Memory manager initialization
static void mem_init(void)
{
    ret_code_t err_code = nrf_mem_init();
    APP_ERROR_CHECK(err_code);
}

// Clock initialization
static void clock_init (void)
{
    ret_code_t err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);

    nrf_drv_clock_lfclk_request(NULL);

    while(!nrf_drv_clock_lfclk_is_running())
    {
        /* Just waiting */
    }
}

// Power managemente initialization
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}

// Function for handling the idle state (main loop)
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


int main(void)
{
    // Start initialization
    clock_init();
    timers_init();
    power_management_init();
    gpio_init();
    serial_init();
    ble_stack_init();
    advertising_init();
    radio_notification_init();
    mem_init();
    crypto_init();                                                                          // Crypto_init must be called AFTER ble_stack_init()!

    // Start execution.
    lastState = YELLOW_STATE;                                                               // Initial traffic light state
    frame_init();
    advertising_start();
    timers_start();

     // Enter main loop.
    for (;;)
    {
    	idle_state_handle();
    }
}
